tutorials/facade/0/Facade_WallRegion/qr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/pyrolysisRegion";
    object      qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Facade_Wall_top
    {
        type            zeroGradient;
    }

    region0_to_Facade_WallRegion_Facade_Wall
    {
        type            mappedField;
        sampleRegion    region0;
        sampleMode      nearestPatchFace;
        samplePatch     region0_to_Facade_WallRegion_Facade_Wall;
        flipNormals     yes;
        offset          (0 0 0);
        fieldName       QrNet;
        setAverage      no;
        average         0;
        value           uniform 0;
    }
}
// ************************************************************************* //

