tutorials/facade/0/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ".*"
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivityMode  lookup;
        emissivity      uniform 0.0;
        value           uniform 0;
    }

    Base
    {
        type            greyDiffusiveRadiation;
        T               T;
        emissivityMode  lookup; //solidThermo
        emissivity      uniform 1.0;
        value           uniform 0;
    }

    region0_to_Facade_WallRegion_Facade_Wall
    {
        type            greyDiffusiveRadiationFF;
        T               T;
        emissivityMode  solidRadiation;
        //emissivityModel lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }
    
    region0_to_Chamber_WallRegion_Chamber_Wall
    {
        type            greyDiffusiveRadiationFF;
        T               T;
        emissivityMode  solidRadiation;
        //emissivityModel lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }
}


// ************************************************************************* //
