tutorials/facade/0/flm
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      flm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 4 -4 0 0 0 0];

internalField   uniform 1e-03;

boundaryField
{
    Sides_air
    {
        type           inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    Outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    Base
    {
        type            fixedValue;
        value           $internalField;
    }

    Inlet
    {
        type            fixedValue;
        value           uniform 1e-6; //value           $internalField;
    }
    
    region0_to_Facade_WallRegion_Facade_Wall
    {
        type            fixedValue;
        value           $internalField;
    }
    
    region0_to_Chamber_WallRegion_Chamber_Wall
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
