tutorials/facade/0/ph_rgh.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Sides_air
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    Outlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    Base
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    Inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    
    region0_to_Facade_WallRegion_Facade_Wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    
    region0_to_Chamber_WallRegion_Chamber_Wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
