tutorials/facade/constant/Chamber_WallRegion/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  opaqueSolid;

absorptionEmissionModel greyMeanSolidAbsorptionEmission;


greyMeanSolidAbsorptionEmissionCoeffs
{
    v
    {
        absorptivity    0.9; //727;  
        emissivity      0.9; //727;
    }

    char
    {
        absorptivity    0.9;
        emissivity      0.9;
    }
}

scatterModel    none;

transmissivityModel    none;


// ************************************************************************* //
