tutorials/facade/constant/Facade_WallRegion/reactions
species
(
    v
    char
);

gaseousSpecies
(
    gas
);

reactions
{
    charReaction
    {
        type        irreversibleArrheniusSolidReaction;
        reaction    "v^1.2579892 = char + gas";
        A           0.0; //3.238963e+10;
        Ta          30000; //15725.35963;  //1.31e5/8.314
        Tcrit       400;
    }
}

