tutorials/facade/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  dev                                   |
  |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       IOobject;
	location    "constant";
	object      reactions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species
(
    C3H8
    O2
    N2
    CO2
    H2O
    //Fstar
);

reactions
{
    propaneReaction
    {
        type irreversibleinfiniteReaction;
        //reaction "C3H8 + 5O2 + 18.8N2 + Fstar = 3CO2 + 4H2O + 18.8N2 + Fstar";
         reaction "C3H8 + 5O2 + 18.8N2 = 3CO2 + 4H2O + 18.8N2";
        //reaction "CH4 + 2O2 + 7.52N2 + Fstar = CO2 + 2H2O + 7.52N2 + Fstar";
        //reaction "C2H4 + 3O2 + 11.28N2 + Fstar = 2CO2 + 2H2O + 11.28N2 + Fstar";
    }

    /*methaneReaction
    {
        type irreversibleinfiniteReaction;
        reaction "CH4 + 2O2 + 7.52N2 + Fstar = CO2 + 2H2O + 7.52N2 + Fstar";
        //reaction "CH4 + 2O2 + 7.52N2 = CO2 + 2H2O + 7.52N2";
    }
    */

}
