tutorials/facade/constant/sootModelProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sootModelProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solveSoot false;

radScaling false;

radSc_Xr_f 0.4;
radSc_Ys_f 0.08;
radSc_Xr_p 0.2;
radSc_Ys_p 0.01;

radSc_fPatch 
(
    "burner"
);

radSc_pPatch
(
    "region0_to_Facade_WallRegion_Facade_Wall"
);

Csc 0.6667; //1.33333;

igniter false;
violateOneMWrule true;
qIgn 44550;
chiIgn 0.8;
ignStartTime 0;
ignRampUpTime 1; //12.0;
ignRampDownTime 60; //127.0;
ignEndTime 65; //600.0;

// ************************************************************************* //
