tutorials/facade/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This application/dictionary controls:
// - optional: create new patches from boundary faces (either given as
//   a set of patches or as a faceSet)
// - always: order faces on coupled patches such that they are opposite. This
//   is done for all coupled faces, not just for any patches created.
// - optional: synchronise points on coupled patches.

// 1. Create cyclic:
// - specify where the faces should come from
// - specify the type of cyclic. If a rotational specify the rotationAxis
//   and centre to make matching easier
// - always create both halves in one invocation with correct 'neighbourPatch'
//   setting.
// - optionally pointSync true to guarantee points to line up.

// 2. Correct incorrect cyclic:
// This will usually fail upon loading:
//  "face 0 area does not match neighbour 2 by 0.0100005%"
//  " -- possible face ordering problem."
// - in polyMesh/boundary file:
//      - loosen matchTolerance of all cyclics to get case to load
//      - or change patch type from 'cyclic' to 'patch'
//        and regenerate cyclic as above


// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(

    {
        name Base;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches
            (
              base0  
            );
    }
    
    {
        name Facade_Wall;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches
            (
              "(FWall.*)"
            );
    }

    {
        name Chamber_Wall;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches
            (
              "(RWall.*)" "(LRWall.*)" "(EWall.*)"
            );
    }
    
    {
        name Sides_air;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        //set side0;
        
        patches
            (
              Sides "(NWall.*)"
            );
        

    }

    {
        // Name of new patch
        name Inlet;

        // Type of new patch
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        //constructFrom set;

        // If constructFrom = set : name of faceSet
        //set burner;
        constructFrom patches;
        patches ( BWall );
    }

);

// ************************************************************************* //
